<template>
  <h3>隱私權政策</h3>
  <p>我們非常重視您的隱私，並致力於保護您的個人資訊。本隱私權政策說明了我們如何收集、使用、分享和保護您在我們購物平台上提供的資訊。</p>

  <h5>1. 我們收集的資訊</h5>
  <ul>
      <li>帳戶資訊：包括您的姓名、電子郵件地址、聯絡電話、寄送地址及帳號相關資訊。</li>
      <li>付款資訊：當您進行購物時，我們將收集付款方式資訊，但我們不會存儲您的完整付款資訊，付款由第三方支付平台處理。</li>
      <li>交易紀錄：我們會保存您的購物紀錄，包括購買的商品、金額和交易時間。</li>
      <li>瀏覽及使用行為：我們會記錄您在本網站上的瀏覽行為，以便改進用戶體驗和服務，包括IP地址、瀏覽器類型、裝置資訊等。</li>
      <li>Cookies：我們可能使用cookies來提升您的使用體驗，並進行數據分析。</li>
  </ul>

  <h5>2. 我們如何使用您的資訊</h5>
  <ul>
      <li>提供服務：為您處理訂單、運送商品並提供客服支援。</li>
      <li>改進平台：透過分析您的行為數據以提升我們的服務和網站功能。</li>
      <li>行銷及宣傳：我們可能會根據您的購物偏好，為您推薦商品和促銷活動（您可以選擇取消訂閱）。</li>
      <li>法律合規：遵守相關法律法規的要求，例如防止欺詐行為或遵循法院命令。</li>
  </ul>

  <h5>3. 資訊的分享</h5>
  <p>我們不會將您的個人資訊出售或出租給第三方。但在以下情況下，我們可能會分享您的資訊：</p>
  <ul>
      <li>合作夥伴：為了完成您的訂單，我們可能會與運送公司、付款處理機構等合作夥伴分享必要資訊。</li>
      <li>法律要求：在法律要求下或為了保護我們的權利和財產時，我們可能會向執法機構披露您的資訊。</li>
      <li>業務轉讓：在發生合併、收購或資產出售時，您的資訊可能會轉移給新的實體。</li>
  </ul>

  <h5>4. 資訊的保護</h5>
  <p>我們採取適當的技術和組織措施，來保護您的個人資訊不受未經授權的存取、變更或遺失。然而，請理解任何數據傳輸皆存在風險，我們無法保證網路傳輸的絕對安全。</p>

  <h5>5. 您的權利</h5>
  <p>您有權查詢、更新、更正或刪除您的個人資訊。若您希望行使這些權利，請透過以下聯絡方式與我們聯繫。</p>

  <h5>6. 政策更新</h5>
  <p>我們可能會不定期修改本隱私權政策，變更將會張貼於本頁面。建議您定期查看以了解最新版本。</p>

  <h5>7. 聯絡我們</h5>
  <p>若您對於本隱私權政策有任何疑問或要求，請聯繫我們：</p>
  <ul>
      <li>電子郵件：support@ezgoo.biz</li>
  </ul>
</template>

<script setup>
import { onMounted } from 'vue'

onMounted(() => {
  window.scrollTo(0, 0)
})
</script>