<template>
  <h3>服務條款</h3>
  <p>歡迎使用我們的購物平台。在使用我們的服務前，請仔細閱讀本服務條款。當您訪問或使用本平台，即表示您同意遵守這些條款。若您不同意，請勿使用本平台的服務。</p>

  <h5>1. 平台角色</h5>
  <ul>
    <li>買家：在平台上搜尋、購買商品的使用者。</li>
    <li>賣家：在平台上上架、銷售商品的使用者。</li>
    <li>平台：我們的購物平台作為交易的中介，提供買家與賣家互相交易的服務，但不參與具體交易過程，亦不對交易雙方的行為負責。</li>
  </ul>

  <h5>2. 帳戶註冊與資格</h5>
  <ul>
    <li>買家：買家必須年滿18歲，並提供真實的個人資訊來進行帳戶註冊。</li>
    <li>賣家：賣家須提供真實且準確的商業資訊。所有賣家必須遵守平台的規定並合法經營。</li>
    <li>帳戶責任：無論買家或賣家，都需對其帳戶行為負責，並妥善保管登入資訊。</li>
  </ul>

  <h5>3. 買家責任</h5>
  <ul>
    <li>訂單確認：買家在確認訂單並支付後，即與賣家形成有效合同。任何訂單變更或取消須與賣家協商處理。</li>
    <li>支付與付款：買家須在平台支持的支付方式下完成付款，若訂單因付款問題而無法確認，平台有權取消訂單。</li>
    <li>商品接收與評價：買家應在收到商品後檢查商品，並有權根據購物經驗給予賣家評價。</li>
  </ul>

  <h5>4. 賣家責任</h5>
  <ul>
    <li>商品上架：賣家須確保上架商品的描述、價格、圖片真實準確，不得上架違法或禁止銷售的商品。</li>
    <li>訂單履行：賣家在接收到訂單後，應及時履行並發貨，並保證商品的質量和包裝完好。</li>
    <li>售後服務：賣家應為買家提供售後服務，並根據平台規定處理退換貨申請。</li>
    <li>佣金和手續費：賣家需支付平台使用手續費或佣金，具體費用將依賣家協議中的規定來收取。</li>
  </ul>

  <h5>5. 平台責任</h5>
  <ul>
    <li>技術支持：我們提供穩定的技術支持以保證平台正常運行，但不對因不可抗力或技術故障導致的中斷負責。</li>
    <li>監管：平台會對買家與賣家的行為進行監管，若發現違規行為，有權採取暫停或終止其帳戶的措施。</li>
    <li>糾紛處理：平台作為中立方，對於買家與賣家之間的交易糾紛提供協調，但不對最終解決結果承擔責任。如最後無法達成協議，將移送政府相關單位處理，本平台將依照相關單位之要求，提供所需資訊。</li>
  </ul>

  <h5>6. 退貨與退款政策</h5>
  <ul>
    <li>買家權利：買家可以在收到商品後，根據賣家提供的退貨政策提出退貨或退款申請。</li>
    <li>賣家責任：賣家須在合理的時間內回應買家的退貨申請，並遵守平台的退貨政策來處理退款。</li>
  </ul>

  <h5>7. 知識產權</h5>
  <p>平台上的所有內容，包括但不限於文字、圖片、標誌、程式碼等，均屬於平台或相關權利人的財產。買家與賣家均不得擅自使用這些內容作商業用途。</p>

  <h5>8. 責任限制</h5>
  <p>平台僅作為交易中介，不對買家或賣家之間的交易行為或商品質量負責。在法律允許的範圍內，平台對於因使用本服務所產生的任何損害不承擔責任。</p>

  <h5>9. 終止與暫停服務</h5>
  <p>平台有權在任何時間因買家或賣家違反條款，或其他合理原因，暫停或終止其帳戶使用權限。</p>

  <h5>10. 條款修改</h5>
  <p>我們保留隨時修改本服務條款的權利。修改後的條款將張貼於平台上，建議您定期查看。若您在條款修改後繼續使用本平台，則視為您接受修改內容。</p>

  <h5>11. 準據法與管轄權</h5>
  <p>本服務條款受中華民國的法律管轄。任何因本條款引發的爭議將提交臺灣臺北地方法院解決。</p>

  <h5>聯絡我們</h5>
  <p>如有任何疑問，請聯繫我們：</p>
  <ul>
      <li>電子郵件：support@ezgoo.biz</li>
  </ul>
</template>

<script setup>
import { onMounted } from 'vue'

onMounted(() => {
  window.scrollTo(0, 0)
})
</script>